app/Http/Controllers/HotelController.php

    public function index(Request $request)
    {
        $query = Hotel::with('category');

        // 名前検索と住所検索
        if($request->name) {
            $query->where('name', 'LIKE', '%' . $request->name . '%');
        }
        if($request->address) {
            $query->where('address', 'LIKE', '%' . $request->address . '%');
        }
        if($request->category) {
            $query->where('category_id', '=', $request->category);
        }
        //商品検索結果
        $hotels = $query->orderBy('id')->paginate(10);

        $categories = Category::all();
---
select * from `categories` where `categories`.`id` in (1, 2, 3)
select * from `hotels` order by `id` asc limit 10 offset 0
select count(*) as aggregate from `hotels`
select * from `categories`

    public function create()
    {
        //新規作成画面を表示
        $hotel = new Hotel;
        $categories = Category::all();
---
select * from `categories`

    public function store(HotelRequest $request)
    {
        //ファイルの取得
        $image = $request->file('image');
        //ファイルの保存とパス取得
        $path = "";
        if(isset($image)) {
            $path = $image->store('public/items');
        }
        Hotel::create([
            'category_id' => $request->category,
            'name' => $request->name,
            'address' => $request->address,
            'email' => $request->email,
            'tel' => $request->tel,
            'image' => $path,
        ]);
---
insert into `hotels` (`category_id`, `name`, `address`, `email`, `tel`, `image`, `updated_at`, `created_at`) values ('1', 'すごい旅館', 'いいところ', 'mao@gmail.com', '03-1515-0404', 'public/items/lmfA0z8IChjI04iiwOxwxzbshfjHMqLYCFNisDcC.png', '2022-05-20 21:03:42', '2022-05-20 21:03:42')

    public function edit(Hotel $hotel)
    {
        $categories = Category::all();
---
select * from `categories`

    public function destroy(Hotel $hotel)
    {
        //ファイルが登録されていれば一緒に削除する
        $path = $hotel->image;
        if($path !== '') {
            \Storage::disk('public')->delete($path);
        }
        $hotel->delete();
---
delete from `hotels` where `id` = 5